/* Note:Your choice is C IDE */
#include<stdio.h>
#include<conio.h>
int main()
{
	int i, j;
	char k;
	char dep[7][20] = { "1.电子工程系","2.机电工程系","3.信息工程系","4.电气工程系","5.经济管理系","6.数字艺术系","7.汽车工程系" };
	char major[7][6][50] = { {"物联网应用技术","应用电子技术","通信技术","移动通信技术","电子信息工程技术"},
							 {"数控技术","模具设计与制造","数控设备应用与维护","机械制造及自动化","机电一体化技术","工业机器人"},
							 {"软件技术","计算机网络技术","信息安全与管理","云计算与应用","大数据应用技术"},
							 {"电气自动化","电梯工程技术","智能控制技术"},
							 {"旅游管理","物流管理","市场营销","电子商务","会计"},
							 {"动漫制作技术","数字媒体应用技术","建筑装饰工程技术"},
							 {"新能源汽车技术","汽车营销与服务","汽车检测与维修技术"} };


	printf("\t《2019年招生专业与类别》\t\n");
	printf("\t\t请选择报考系部:\n");

	while (1)
	{
		for (i = 0; i < 7; i++)
		{
			printf("\t\t%s\n", dep[i]);
		}

		k = getchar();
		printf("\n");

		if (k < '0' || k >'7')
		{
			printf("\t\t请重新选择报考系部:\n");
			continue;
		}
		else
			break;
	}
	k -= 48;
	printf("\n");

	for (j = 0; j < 6; j++)
	{
		printf("\t\t%d.%s\n", j + 1, major[k][j]);
	}
}